app/controllers/comments_controller.rb

  def create
    # binding.pry
    @post = Post.find(params[:post_id])
    @post.comments.build(:author => params[:author], :content => params[:content])
    if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", ":post_id"]]
INSERT INTO "comments" ("author", "content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "twice"], ["content", "hha"], ["created_at", Fri, 14 Mar 2014 21:48:44 UTC +00:00], ["post_id", 1], ["updated_at", Fri, 14 Mar 2014 21:48:44 UTC +00:00]]