app/controllers/posts_controller.rb

  def create
    # POST '/posts'

    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("author", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "sam"], ["content", "magic!"], ["created_at", Fri, 14 Mar 2014 19:43:47 UTC +00:00], ["title", "is this just going to work"], ["updated_at", Fri, 14 Mar 2014 19:43:47 UTC +00:00]]